spec/support/mvi/find_candidate_ar_code_database_error_response.xml

<!--
  This is an 'AR' failure response from MVI.
  An 'AR' response indicates that something is wrong with the MVI service (system down, internal error, etc.)
  Specs to test handling of 'AR' responses will have to use this file.
  A VCR cassette cannot be generated because
  'AR' responses occur due to issues unrelated to how a request is constructed.
-->
<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Header/>
  <env:Body>
    <idm:PRPA_IN201306UV02 xmlns:idm="http://vaww.oed.oit.va.gov" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd" xmlns="urn:hl7-org:v3" ITSVersion="XML_1.0">
      <id root="2.16.840.1.113883.4.349" extension="WS1909251643559041988507482"/>
      <creationTime value="20190925164355"/>
      <versionCode code="1.0"/>
      <interactionId root="2.16.840.1.113883.1.6" extension="PRPA_IN201306UV02"/>
      <processingCode code="T"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="NE"/>
      <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="1.2.840.114350.1.13.999.567" extension="200ESR"/>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="2.16.840.1.113883.4.349" extension="200M"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AR"/>
        <targetMessage>
          <id root="1.2.840.114350.1.13.0.1.7.1.1" extension="MCID-12345"/>
        </targetMessage>
        <acknowledgementDetail>
          <text>
            <![CDATA[Environment Database Error]]>
          </text>
        </acknowledgementDetail>
      </acknowledgement>
      <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_TE201306UV02" codeSystem="2.16.840.1.113883.1.6"/>
        <queryAck>
          <queryId root="1.2.840.114350.1.13.28.1.18.5.999" extension="18204"/>
          <queryResponseCode code="AE"/>
          <resultCurrentQuantity value="0"/>
        </queryAck>
        <queryByParameter>
          <!-- Unique identifier for the query  -->
          <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
          <!-- The status of the query, default is "new" -->
          <statusCode code="new"/>
          <!-- MVI.COMP1=Add GetCorIds only Correlations MVI.COMP2=Add GetCorIds with Correlations and ICN History -->
          <modifyCode code="MVI.COMP1"/>
          <!-- Attribute 'responseElementGroupId' indicates if Response should be the Primary View or Correlation, default is 
    Primary View. -->
          <!-- extension="PV" root="2.16.840.1.113883.4.349  = Return Primary View -->
          <!-- extension="COR" root="2.16.840.1.113883.4.349 = Return Correlation -->
          <responseElementGroupId extension="PV" root="2.16.840.1.113883.4.349"/>
          <!-- The return quantity should always be 1 for the retrieve -->
          <initialQuantity value="1"/>
          <!-- Identifier section: ONLY one identifier is valid, either an ICN or Correlation Id -->
          <parameterList>
            <id extension="1234^PI^523^USVHA" root="2.16.840.1.113883.4.349"/>
          </parameterList>
        </queryByParameter>
      </controlActProcess>
    </idm:PRPA_IN201306UV02>

  </env:Body>
</env:Envelope>
